app/controllers/carts_controller.rb

SELECT COUNT(*) FROM `carts` WHERE `carts`.`actif` = 1
SELECT `carts`.* FROM `carts` WHERE `carts`.`actif` = 1 ORDER BY `carts`.`id` DESC LIMIT 1
INSERT INTO `carts` (`actif`, `created_at`, `updated_at`) VALUES (1, '2014-07-01 14:41:47', '2014-07-01 14:41:47')
SELECT `products`.* FROM `products` INNER JOIN `carts_products` ON `products`.`id` = `carts_products`.`product_id` WHERE `carts_products`.`cart_id` = 1
INSERT INTO `products_carts` (`created_at`, `id_cart`, `id_product`, `price`, `quantity`, `updated_at`) VALUES ('2014-07-01 14:47:58', 1, 2, 623.0, 1.0, '2014-07-01 14:47:58')
---
  def addToCart
    if !Cart.where(:actif => true).empty?
      cart = Cart.where(:actif => true).last
    else
      cart = Cart.new
      cart.actif = 1
      cart.save
    end

    puts YAML::dump( cart.products )
    cart.products = [Product.find(params[:id])]
    cart.save

SELECT `carts`.* FROM `carts` WHERE `carts`.`actif` = 1 ORDER BY `carts`.`id` DESC LIMIT 1
---
  def show
    cart = Cart.where(:actif => true).last