app/controllers/ingredients_controller.rb

SELECT `ingredients`.* FROM `ingredients`
---
  def index
    @ingredients = Ingredient.all

INSERT INTO `ingredients` (`created_at`, `description`, `price`, `slug`, `title`, `updated_at`) VALUES ('2014-07-01 20:28:27', 'test', 4567.0, 'lapis-lezuli', 'Lapis lézuli', '2014-07-01 20:28:27')
---
  def create
    @ingredient = Ingredient.new(ingredient_params)
    # puts YAML::dump( params[:image] )

    if @ingredient.image != nil && defined?(@ingredient.image) && (@ingredient.image.original_filename != '')
      @ingredient.image = @ingredient.save_image(@ingredient.image, @ingredient.title)

SELECT `ingredients`.* FROM `ingredients` WHERE `ingredients`.`id` = 4 LIMIT 1
---
  def edit
    @ingredient = Ingredient.find(params[:id])

SELECT `ingredients`.* FROM `ingredients` WHERE `ingredients`.`id` = 4 LIMIT 1
UPDATE `ingredients` SET `description` = 'c\'est vert, comme ta m...', `updated_at` = '2014-06-30 13:25:33' WHERE `ingredients`.`id` = 4
---
  def update
    @ingredient = Ingredient.find(params[:id])
    # puts YAML::dump( params[:ingredient][:image] )

    if params[:ingredient][:image]
      @ingredient.cleanup
      @ingredient.image = @ingredient.save_image(params[:ingredient][:image], @ingredient.title)

SELECT `ingredients`.* FROM `ingredients` WHERE `ingredients`.`id` = 6 LIMIT 1
DELETE FROM `ingredients` WHERE `ingredients`.`id` = 6
---
  def destroy
    @ingredient = Ingredient.find(params[:id])
    if @ingredient.destroy

SELECT `ingredients`.* FROM `ingredients` WHERE `ingredients`.`id` = 4 LIMIT 1
---
  def show
    @ingredient = Ingredient.find(params[:id])