app/controllers/products_controller.rb

  def new
    @ingredients = Ingredient.all
---
SELECT `ingredients`.* FROM `ingredients`

  def create
    @product = Product.new(product_params)

    addIngredients = [];

    params[:product][:ingredients].each do |id_ingredient|
      addIngredients.push(Ingredient.find(id_ingredient))
    end
    @product.ingredients = addIngredients
    # puts YAML::dump( params[:image] )

    if @product.image != nil
      @product.save_image(@product.image)
---
SELECT `ingredients`.* FROM `ingredients` ORDER BY `ingredients`.`id` ASC LIMIT 1
SELECT `ingredients`.* FROM `ingredients` WHERE `ingredients`.`id` = 3 LIMIT 1
INSERT INTO `products` (`created_at`, `description`, `marge`, `title`, `updated_at`) VALUES ('2014-06-30 15:03:17', 'ffh', 10.0, 'sdhfnn', '2014-06-30 15:03:17')

  def edit
    @product = Product.find(params[:id])
    @ingredients = Ingredient.all
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1
SELECT `ingredients`.* FROM `ingredients`

  def update
    @product = Product.find(params[:id])
    addIngredients = [];
    # puts YAML::dump( params[:product] )
    if params[:product][:ingredients]
      params[:product][:ingredients].each do |id_ingredient|
        addIngredients.push(Ingredient.find(id_ingredient))
    end
      @product.ingredients = addIngredients
    else
      @product.ingredients = addIngredients
    end
    # puts YAML::dump( @product )

    if @product.image != nil
      @product.save_image(@product.image)
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1
SELECT `ingredients`.* FROM `ingredients` WHERE `ingredients`.`id` = 3 LIMIT 1
UPDATE `products` SET `slug` = 'bague-amethyste', `updated_at` = '2014-07-01 21:24:27' WHERE `products`.`id` = 1

  def destroy
    @product = Product.find(params[:id])
    if @product.destroy
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 4 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 4