app/views/products/_form.html.erb

                        <%
                            checked = @product.ingredients.map(&:id).include?(i.id) ? true : false
---
SELECT `ingredients`.* FROM `ingredients` INNER JOIN `ingredients_products` ON `ingredients`.`id` = `ingredients_products`.`ingredient_id` WHERE `ingredients_products`.`product_id` = 24