app/views/products/index.html.erb

SELECT `ingredients`.* FROM `ingredients` INNER JOIN `ingredients_products` ON `ingredients`.`id` = `ingredients_products`.`ingredient_id` WHERE `ingredients_products`.`product_id` = 1
---
        total = 0
        product.ingredients.each do |ingredient|